feat: groot - sagemaker training job
